In [3]:
person = {
    "first": "Shankar",
    "last": "R",
    "age": 41
}

In [4]:
people = {
    "first": ["Shankar"],
    "last": ["R"],
    "age": [41]
}

In [5]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],
    "age": [41, 40, 5]
}

In [7]:
people["age"]

[41, 40, 5]

In [8]:
import pandas as pd

In [10]:
df = pd.DataFrame(people)

In [11]:
df

     first last  age
0  Shankar    R   41
1     Niru    S   40
2  Akshara    S    5

In [13]:
df["age"]

0    41
1    40
2     5
Name: age, dtype: int64

In [14]:
type(df["age"])

pandas.core.series.Series

In [16]:
df.age

0    41
1    40
2     5
Name: age, dtype: int64

In [17]:
df[["last", "age"]]

  last  age
0    R   41
1    S   40
2    S    5

In [18]:
type(df[["last", "age"]])

pandas.core.frame.DataFrame

In [19]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [22]:
df.iloc[0]

first    Shankar
last           R
age           41
Name: 0, dtype: object

In [23]:
df.iloc[[0,1]]

     first last  age
0  Shankar    R   41
1     Niru    S   40

In [24]:
df.iloc[[0,1], 2]

0    41
1    40
Name: age, dtype: int64

In [26]:
df

     first last  age
0  Shankar    R   41
1     Niru    S   40
2  Akshara    S    5

In [30]:
df.loc[[0, 1]]

     first last  age
0  Shankar    R   41
1     Niru    S   40

In [32]:
df.loc[[0,1], "age"]

0    41
1    40
Name: age, dtype: int64